IdeaRS.OpenModel.Connection.CutBeamByBeamData
Provides data of the cut objec by object

IdeaRS.OpenModel.Connection.CutBeamByBeamData.ModifiedObject
Modified object

IdeaRS.OpenModel.Connection.CutBeamByBeamData.CuttingObject
Cutting by object

IdeaRS.OpenModel.Connection.CutBeamByBeamData.IsWeld
is cut welded